Repository: getastra/wp-security-hardening
Catalog: languages/whp-*.po
Languages: fr_fr

source: <p>Howdy! %s</p> <p>Greetings!</p> <p>As a part of our routine WordPress Hardening check, we ran a scan on %s. We found that there are still some improvements that can be made to harden the site. I have listed them below for your convenience:</p> %s <p style="text-align:center;"><a style="margin:10px auto; font-size:18px;" href="%s">Check the details here</a></p> <p>To ensure the maximum hardening of your WordPress website, we recommend that you implement the fixes at the earliest. You’ll find details of the fixes, under the ‘Hardening Audit’ tab in your WordPress backend.</p> <p>Thanks,</p> <p>Ananda from Astra</p>
fr_fr: <p>Howdy ! %s</p> <p>Salut ! </p> <p>Dans le cadre de notre contrôle de routine de la sécrité de WordPress, nous avons effectué un balayage sur les %s. Nous avons constaté que certaines améliorations peuvent encore être apportées pour protéger le site. Nous les avons énumérées ci-dessous :</p> %s <p style="text-align:center ;"><a style="margin:10px auto ; font-size:18px ;" href="%s">Vérifiez les détails ici</a></p> <p> Pour garantir un durcissement maximal de votre site WordPress, nous vous recommandons d'appliquer ces correctifs au plus tôt. Vous trouverez le détail des corrections sous l'onglet "Audit de sécurité" dans votre backend WordPress <p>Merci, </p> <p>Ananda de Astra</p>

source: recommendations
fr_fr: recommandations

source: %d WordPress Hardening recommendations for %s
fr_fr: Recommandations pour la sécurité du %d WordPress pour les %s

source: %s Site Health
fr_fr: %s Santé du site

source: <a target="_blank" href="https://wordpress.org/plugins/getastra/">Astra Firewall</a> leverages continuous and comprehensive protection to your website. Astra firewall stops attacks like XSS, SQLi, LFI, RFI, Bad bots & 100+ type of security threats in real time.
fr_fr: <a target="_blank" href="https://wordpress.org/plugins/getastra/">Astra Firewall</a> assure une protection continue et complète de votre site web. Le pare-feu Astra bloque en temps réel les attaques de type XSS, SQLi, LFI, RFI, Bad bots et plus de 100 menaces de sécurité.

source: Activated
fr_fr: Activé

source: Admin & API Security
fr_fr: Sécurité de l'administration et des API

source: An older WordPress version was detected on your Website. Update it ASAP to keep yourself secure. You need to update WordPress to %s. Your current version is: %s
fr_fr: Une ancienne version de WordPress a été détectée sur votre site web. Mettez-la à jour dès que possible pour vous protéger. Vous devez mettre à jour WordPress en %s. Votre version actuelle est la suivante : %s

source: Audit Recommendations
fr_fr: Recommandations de l'audit

source: Be sure to check with your host to make sure they have a plan to update before the security support ends.
fr_fr: Vérifiez auprès de votre hôte qu'il a un plan de mise à jour avant la fin du support de sécurité.

source: Bravo! Your WordPress Version is up to date!
fr_fr: Bravo ! Votre version WordPress est à jour !

source: Change Login URL
fr_fr: Changer l'URL de connexion

source: Change to a stronger Password. Take help from this <a href="https://www.getastra.com/blog/knowledge-base/create-safe-and-secure-passwords/" target="_blank">guide</a> to create strong passwords for your website.
fr_fr: Passez à un mot de passe plus fort. Aidez-vous de ce <a href="https://www.getastra.com/blog/knowledge-base/create-safe-and-secure-passwords/" target="_blank">guide</a> pour créer des mots de passe forts pour votre site web.

source: Check for active PHP version
fr_fr: Vérifier la version active de PHP

source: Collapse All
fr_fr: Tout effondrer

source: Common page builders often are diagnosed with a vulnerability putting your website’s security at risk. With this toggle enabled, the version of these page builders will be hidden making it difficult for hackers to find if you’re using a vulnerable version.
fr_fr: Les créateurs de pages courants sont souvent confrontés à une vulnérabilité qui met en péril la sécurité de votre site web. Lorsque cette option est activée, la version de ces créateurs de pages est cachée, ce qui rend difficile pour les pirates de trouver si vous utilisez une version vulnérable.

source: Correct file permissions are in place.
fr_fr: Les permissions sur les fichiers sont bien configurées.

source: Critical
fr_fr: Critique

source: Database Password Strength
fr_fr: Force du mot de passe de la base de données

source: DB strength
fr_fr: La force de la DB

source: Details
fr_fr: Détails

source: Disable File Editor
fr_fr: Désactiver l'éditeur de fichiers

source: Disable Information Disclosure & Remove Meta information
fr_fr: Désactiver la divulgation d'informations et supprimer les méta-informations

source: Disable WP API JSON
fr_fr: Désactiver le WP API JSON

source: Disable XMLRPC
fr_fr: Désactiver XMLRPC

source: Disabled
fr_fr: Handicapés

source: Enable Firewall
fr_fr: Activer le pare-feu

source: Enter new slug
fr_fr: Saisir une nouvelle limace

source: Error checking PHP health.
fr_fr: Erreur de vérification de la santé du PHP.

source: Expand All
fr_fr: Tout développer

source: File Permission
fr_fr: Permissions sur les fichiers

source: File Permission Checker
fr_fr: Contrôleur d'autorisation de fichier

source: File permissions ensure privacy as well as security of your website. Glad you know that too :-)
fr_fr: Les permissions sur les fichiers garantissent la confidentialité ainsi que la sécurité de votre site web. Heureux que vous le sachiez aussi :-)

source: Firewall Detected
fr_fr: Pare-feu détecté

source: Firewall Status
fr_fr: État du pare-feu

source: Firewalls are a great way to monitor & protect your website against hacks. But, of course you know that :-)
fr_fr: Les pare-feu sont un excellent moyen de surveiller et de protéger votre site web contre les pirates. Mais, bien sûr, vous savez que :-)

source: Further strengthen your WordPress site and make it difficult for hackers, enable security fixers
fr_fr: Renforcer votre site WordPress et le rendre plus difficile pour les pirates, permettre aux correcteurs de sécurité

source: Get Malware Cleanup
fr_fr: Nettoyer les logiciels malveillants

source: Good job using strong passwords for your database!
fr_fr: Bon travail d'utilisation de mots de passe forts pour votre base de données !

source: Good job! Your server is running PHP version %1$s which will receive security updates until %2$s.
fr_fr: Bon travail ! Votre serveur exécute la version PHP %1$s qui recevra des mises à jour de sécurité jusqu'à %2$s.

source: Great! All your plugins are running on the latest versions!
fr_fr: Bravo, toutes vos extensions sont à jour !

source: Hackers & bad bots can easily find usernames in WordPress by visiting URLs like yourwebsite.com/?author=1. This can significantly help them in performing larger attacks like Bruteforce & SQL injection.
fr_fr: Les pirates et les mauvais robots peuvent facilement trouver des noms d'utilisateurs dans WordPress en visitant des URL comme yourwebsite.com/?author=1. Cela peut les aider considérablement à réaliser des attaques plus importantes comme Bruteforce et l'injection SQL.

source: Hardening Audit
fr_fr: Audit de sécurité

source: Has Firewall
fr_fr: Possède un pare-feu

source: Help
fr_fr: Aide

source: Hide
fr_fr: Cacher

source: Hide Directory Listing of WP includes
fr_fr: Cacher la liste de l'annuaire du WP comprend

source: Hide WordPress Version Number
fr_fr: Masquer le numéro de version WordPress

source: Hurray! Your PHP version is up to date!
fr_fr: Hourra ! Votre version de PHP est à jour !

source: If a hacker is able to get access to your WordPress admin, with the file editor enabled it becomes quite easy for them to add malicious code to your theme or plugins. If you are not using this, it’s best to keep the file editor disabled.
fr_fr: Si un pirate informatique est capable d'accéder à votre administrateur WordPress, avec l'éditeur de fichiers activé, il devient assez facile pour lui d'ajouter du code malveillant à votre thème ou à vos plugins. Si vous ne l'utilisez pas, il est préférable de laisser l'éditeur de fichiers désactivé.

source: Improve Hardening
fr_fr: Améliorer la sécurité

source: Inactive plugins
fr_fr: Plugins inactifs

source: Last Audit on
fr_fr: Dernier audit sur

source: Login url
fr_fr: URL de connexion

source: Make Audit
fr_fr: Faire un audit

source: Managing and securing file permission should not be overlooked. This <a href="https://www.getastra.com/blog/cms/wordpress-security/fixing-wordpress-file-permissions/" target="_blank" >guide</a> will help you secure the recommended file permissions on your WordPress. <br/><br/><table class="table table-responsive table-striped"><thead><tr><th>Current Permission</th><th>File Path</th></tr></thead><tbody>
fr_fr: Il ne faut pas négliger la configuration des permissions sur les fichiers. Vous pouvez les réinitialiser correctement en activant puis désactivant l'option "Read Only" depuis votre interface de gestion Themecloud.

source: Many CSS files have the WordPress version number appended to their source, for cache purposes. Knowing the version number allows hackers to exploit known vulnerabilities.
fr_fr: De nombreux fichiers CSS portent le numéro de version de WordPress en annexe de leur source, à des fins de cache. La connaissance du numéro de version permet aux pirates d'exploiter des vulnérabilités connues.

source: Many JS files have the WordPress version number appended to their source, for cache purposes. Knowing the version number allows hackers to exploit known vulnerabilities.
fr_fr: De nombreux fichiers JS ont le numéro de version WordPress annexé à leur source, à des fins de cache. La connaissance du numéro de version permet aux pirates d'exploiter des vulnérabilités connues.

source: Modify Settings
fr_fr: Modifier les paramètres

source: Move to the latest and secured version with this <a href="https://www.getastra.com/blog/cms/wordpress-security/wordpress-security-guide/#3-Update-your-PHP-to-the-latest-version">guide</a> here.
fr_fr: Passez à la version la plus récente et sécurisée avec ce <a href="https://www.getastra.com/blog/cms/wordpress-security/wordpress-security-guide/#3-Update-your-PHP-to-the-latest-version">guide</a> ici.

source: Network Settings
fr_fr: Paramètres du réseau

source: Networkwide default
fr_fr: Défaillance à l'échelle du réseau

source: Nice! You have a firewall installed.
fr_fr: Joli ! Vous avez installé un pare-feu.

source: No, thanks
fr_fr: Non, merci

source: Oh wow! You are well-protected by Astra!
fr_fr: Oh wow ! Vous êtes bien protégé par Astra !

source: Old PHP Version
fr_fr: Ancienne version de PHP

source: Oops! We were not able to detect any WordPress security plugin on your website.
fr_fr: Oups ! Nous n'avons pu détecter aucun plugin de sécurité WordPress sur votre site web

source: Oops! We were not able to detect Astra Security on your site. Please contact Themecloud support.
fr_fr: Oups ! Nous n'avons pas pu détecter Astra Security sur votre site. Veuillez contacter le support Themecloud.

source: Oops! Your site is not protected yet, please connect a domain to enable Astra Security firewall.
fr_fr: Oups ! Votre site n'est pas encore protégé, veuillez connecter un domaine pour activer le pare-feu Astra Security

source: Outdated plugins were detected on your website. Update them to the latest version to stay secure!
fr_fr: Des plugins obsolètes ont été détectés sur votre site web. Mettez-les à jour avec la dernière version pour rester en sécurité !

source: Passed Test
fr_fr: Test réussi

source: Passed Tests
fr_fr: Tests réussis

source: Password must include at least one letter!
fr_fr: Le mot de passe doit comporter au moins une lettre !

source: Password must include at least one number!
fr_fr: Le mot de passe doit comporter au moins un chiffre !

source: Password too short!
fr_fr: Mot de passe trop court !

source: PHP version %s is recognized as the most secured version as of now.
fr_fr: La version PHP %s est reconnue comme la version la plus sécurisée à l'heure actuelle

source: Please clear your WordPress cache for these changes to reflect
fr_fr: Veuillez vider votre cache WordPress pour que ces changements reflètent

source: Please enter an admin URL slug which only has alpha-numeric characters
fr_fr: Veuillez entrer une URL d'administration qui ne comporte que des caractères alphanumériques

source: Plugins (%s) require immediate update. Follow this <a href="%s">link</a> to update now.
fr_fr: Les plugins (%s) nécessitent une mise à jour immédiate. Suivez ce <a href="%s">lien</a> pour mettre à jour maintenant.

source: Poor file & folder permissions detected.
fr_fr: Mauvaises permissions de fichiers et de dossiers détectées.

source: Prevent admin password brute-forcing by changing the URL for the wp-admin login area. You can change the url only when this fixer is disabled.
fr_fr: Empêchez le forçage brutal du mot de passe de l'administrateur en modifiant l'URL de la zone de connexion wp-admin. Vous ne pouvez changer l'URL que lorsque ce correcteur est désactivé.

source: Recommendations
fr_fr: Recommandations

source: Remove Slider Revolution Meta Generator Tag
fr_fr: Supprimer l'étiquette du générateur de métadonnées de Slider Revolution

source: Remove Version from Script
fr_fr: Supprimer la version du script

source: Remove Version from Stylesheet
fr_fr: Supprimer une version de la feuille de style

source: Remove Visual Composer / WPBakery Page Builder Meta Generator Tag
fr_fr: Supprimer l'étiquette du générateur de métadonnées de Visual Composer / WPBakery Page Builder

source: Remove WordPress Meta Generator Tag
fr_fr: Supprimer l'étiquette du générateur de métadonnées WordPress

source: Remove WPML (WordPress Multilingual Plugin) Meta Generator Tag
fr_fr: Supprimer l'étiquette du générateur de métadonnées WPML (WordPress Multilingual Plugin)

source: Request a malware cleanup
fr_fr: Demander un nettoyage de logiciels malveillants

source: Security Fixers
fr_fr: Correcteurs de sécurité

source: Send Me Security Updates
fr_fr: Envoyez-moi les mises à jour de sécurité

source: Server Hardening
fr_fr: Sécurité du serveur

source: Settings
fr_fr: Paramètres

source: Settings saved
fr_fr: Paramètres sauvegardés

source: Since 4.4 version, WordPress added JSON REST API which largely benefits developers. However, it’s often targeted for bruteforce attacks just like in the case of xmlrpc. If you are not using it, best is to disable it.
fr_fr: Depuis la version 4.4, WordPress a ajouté l'API JSON REST qui profite largement aux développeurs. Cependant, il est souvent la cible d'attaques en force brute, comme dans le cas de xmlrpc. Si vous ne l'utilisez pas, le mieux est de la désactiver.

source: Slider revolution stays on the radar of hackers due to its popularity. An overnight hack in the version you’re using could lead your website vulnerable too. Make it difficult for hackers to exploit the vulnerabilities by disabling version number disclosure here.
fr_fr: La révolution des glisseurs reste dans le collimateur des pirates informatiques en raison de sa popularité. Un piratage du jour au lendemain dans la version que vous utilisez pourrait rendre votre site web vulnérable lui aussi. Rendez difficile l'exploitation des vulnérabilités par les pirates en désactivant la divulgation du numéro de version ici.

source: some issue description
fr_fr: description de certains problèmes

source: Sorry! The current database password is not strong. Try something more secure?
fr_fr: Désolé ! Le mot de passe actuel de la base de données n'est pas fort. Essayez quelque chose de plus sûr ?

source: Start a New Audit
fr_fr: Commencer un nouvel audit

source: Stop User Enumeration
fr_fr: Recensement des utilisateurs de l'arrêt

# Text string for settings page
source: Change Admin Login URL
fr_fr: Changer l'URL de connexion de l'administration

# Text string for settings page
source: Rename wp-login.php
fr_fr: Renommer wp-login.php

source: The WordPress Meta tag contains your WordPress version number which is best kept hidden
fr_fr: La balise WordPress Meta contient votre numéro de version WordPress, qu'il est préférable de garder caché

source: These recommendations are provided by WP Hardening, and are specific to your site. For more information, <a href="https://astra.sh/wp-knowledge-base">read the documentation</a> or <a href="https://astra.sh/wp-malware-removal">contact us</a>
fr_fr: Ces recommandations sont fournies par WP Hardening, et sont spécifiques à votre site. Pour plus d'informations, <a href="https://astra.sh/wp-knowledge-base">lisez la documentation</a> ou <a href="https://astra.sh/wp-malware-removal">contactez-nous</a>

source: This discloses the WordPress version number which is best kept hidden.
fr_fr: Cela permet de connaître le numéro de version de WordPress qu'il est préférable de garder caché.

source: This feature is not enabled.
fr_fr: Cette fonction n'est pas activée.

source: This gives away your WordPress version number making life of a hacker simple as they’ll be able to find targeted exploits for your WordPress version. It’s best to keep this hidden, enabling the button shall do that.
fr_fr: Le numéro de votre version de WordPress est ainsi donné, ce qui simplifie la vie des pirates informatiques qui pourront trouver des exploits ciblés pour votre version de WordPress. Il est préférable de garder cela caché, l'activation du bouton le fera.

source: This option allows you to set a network-wide default, which can be overridden by individual sites. Simply go to to the site’s permalink settings to change the url.
fr_fr: Cette option vous permet de définir une valeur par défaut pour l'ensemble du réseau, qui peut être remplacée par des sites individuels. Il suffit d'aller dans les paramètres des permaliens du site pour modifier l'url.

source: To set a networkwide default, go to %s.
fr_fr: Pour définir une valeur par défaut à l'échelle du réseau, allez à %s.

source: Upgrade to Firewall
fr_fr: Mise à niveau vers un pare-feu

source: Using an unsupported version of PHP means that you are using a version that no longer receives important security updates and fixes. Also, newer versions are faster which makes your site load faster. You must update your PHP or contact your host immediately!
fr_fr: L'utilisation d'une version non supportée de PHP signifie que vous utilisez une version qui ne reçoit plus les mises à jour et corrections de sécurité importantes. De plus, les nouvelles versions sont plus rapides, ce qui accélère le chargement de votre site. Vous devez mettre à jour votre PHP ou contacter votre hébergeur immédiatement !

source: View all recommendations
fr_fr: Voir toutes les recommandations

source: View Help Docs
fr_fr: Voir les documents d'aide

source: View Results
fr_fr: Voir les résultats

source: We found the following improvements for your website.<br/> Please review them below!
fr_fr: Nous avons trouvé les améliorations suivantes pour votre site web.<br/> Veuillez les passer en revue ci-dessous !

source: WordPress Hardening Audit
fr_fr: Audit de sécurité WordPress

source: WordPress plugin version check
fr_fr: Vérification de la version du plugin WordPress

source: WordPress Security Fixers
fr_fr: Correctifs de sécurité pour WordPress

source: WordPress version check
fr_fr: Vérification de la version WordPress

source: WP Harden performs a quick audit to assist you in Hardening your WordPress website
fr_fr: WP Hardening effectue un audit rapide pour vous aider à sécuriser votre site WordPress

source: WP Hardening
fr_fr: WP Protection

source: WP-includes directory gives away a lot of information about your WordPress to hackers. Disable it by simply toggling the option to ensure you make reconnaissance of hackers difficult.
fr_fr: Le répertoire WP-includes donne aux pirates de nombreuses informations sur votre WordPress. Désactivez-le en basculant simplement l'option pour vous assurer que vous rendez la reconnaissance des pirates difficile.

source: Wrong WP version
fr_fr: Mauvaise version du WP

source: XMLRPC is often targeted by bots to perform brute force & DDoS attacks (via pingback) causing considerable stress on your server. However, there are some services which rely on xmlrpc. Be sure you definitely do not need xmlrpc before disabling it. If you are using Astra firewall, then you’re safe against xmlrpc attacks automatically.
fr_fr: XMLRPC est souvent ciblé par des robots pour effectuer des attaques par force brute et DDoS (via pingback), ce qui provoque un stress considérable sur votre serveur. Cependant, certains services reposent sur xmlrpc. Assurez-vous que vous n'avez pas besoin de xmlrpc avant de le désactiver. Si vous utilisez le pare-feu Astra, vous êtes automatiquement protégé contre les attaques xmlrpc.

source: You are following good password practices for your website. We recommend that you change your passwords often.
fr_fr: Vous suivez les bonnes pratiques en matière de mot de passe pour votre site web. Nous vous recommandons de changer souvent vos mots de passe.

source: You can enable/disable fixers as per your requirement. We’ve already enabled important ones for you.
fr_fr: Vous pouvez activer/désactiver les correcteurs selon vos besoins. Nous avons déjà activé les plus importants pour vous.

source: You didnt made scan yet. Scan system to check issues.
fr_fr: Vous n'avez pas encore fait de scan. Système de balayage pour vérifier les problèmes.

source: You must log in to access the admin area.
fr_fr: Vous devez vous connecter pour accéder à la zone d'administration.

source: You need to update WordPress to latest version
fr_fr: Vous devez mettre à jour WordPress avec la dernière version

source: Your current PHP version is outdated and can invite hackers.
fr_fr: Votre version actuelle de PHP est obsolète et peut inviter des pirates informatiques.

source: Your login page is now here: %s. Bookmark this page!
fr_fr: Votre page de connexion est maintenant ici : %s. Ajoutez cette page à vos favoris !

source: Your server is running PHP version %1$s which has not been supported since %2$s.
fr_fr: Votre serveur exécute la version de PHP %1$s qui n'est plus supportée depuis %2$s.

source: Your site is well protected
fr_fr: Votre site est bien protégé

source: Your site is well protected.
fr_fr: Votre site est bien protégé.

source: Your website is running the most secure version ( %s ) of WordPress.
fr_fr: Votre site web utilise la version la plus sécurisée ( %s ) de WordPress.
